<p><span style="font-size: 14pt;">Az Oper&aacute;ci&oacute;s rendszerek az első f&eacute;l&eacute;ves Sz&aacute;m&iacute;t&oacute;g&eacute;pes rendszerek t&aacute;rgy folytat&aacute;sa, az ott eml&iacute;tett alapismeretek m&eacute;ly&iacute;t&eacute;se, valamint a C programoz&aacute;si nyelvi ismeretek elsaj&aacute;t&iacute;t&aacute;sa. A tant&aacute;rgy c&eacute;lja, hogy a hallgat&oacute;k nagyobb betekint&eacute;st kapjanak az oper&aacute;ci&oacute;s rendszerek alapjaiba, &eacute;s haszn&aacute;lj&aacute;k ki ezek előnyeit.</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;">A tant&aacute;rgy tansz&eacute;ke: M&eacute;dia- &eacute;s Oktat&aacute;sinformatikai Tansz&eacute;k</span></p>
<p><span style="font-size: 14pt;">Tant&aacute;rgy honlapja: <a class="inline_disabled" title="Link" href="http://opsys.inf.elte.hu/" target="_blank" rel="noopener">opsys.inf.elte.hu</a></span></p>
<p><span style="font-size: 14pt;">Tant&aacute;rgy felelőse: Dr. Ill&eacute;s Zolt&aacute;n</span></p>
<p><span style="font-size: 14pt;">Gyakorlatvezető: Rajhona Le&oacute;na, el&eacute;rhetős&eacute;g: <a class="inline_disabled" title="Link" href="mailto:qhn5x3@inf.elte.hu" target="_blank" rel="noopener">qhn5x3@inf.elte.hu</a></span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;">Fontos: a gyakorlatok sor&aacute;n, egyes C nyelvű programok futtat&aacute;sakor &eacute;s Linux k&ouml;nyvt&aacute;rak vizsg&aacute;latakor a kor&aacute;bban megismert szamrend.inf.elte.hu vagy az opsys.inf.elte.hu szervereket kell haszn&aacute;lni. A haszn&aacute;lt seg&eacute;dprogram a j&oacute;l ismert PUTTY, amelyen kereszt&uuml;l megval&oacute;s&iacute;tjuk a kapcsolatot. Mindemellett, a f&aacute;jlok &aacute;th&uacute;z&aacute;s&aacute;hoz a WinSCP szoftver haszn&aacute;lata javallott.</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;">A sz&aacute;monk&eacute;r&eacute;sek a f&eacute;l&eacute;v sor&aacute;n elosztva fognak t&ouml;rt&eacute;nni. Az előad&aacute;sok időpontj&aacute;ban a f&eacute;l&eacute;v sor&aacute;n egyetlen elm&eacute;leti kv&iacute;z kit&ouml;lt&eacute;se sz&uuml;ks&eacute;ges, a gyakorlati anyagot fel&ouml;lelő sz&aacute;monk&eacute;r&eacute;s pedig egy &eacute;vfolyam ZH lesz, val&oacute;sz&iacute;nűleg a Lovard&aacute;ban. A f&eacute;l&eacute; sor&aacute;n 2 beadand&oacute;t kell megcsin&aacute;lni.</span></p>
<ul style="list-style-type: disc;">
<li><span style="font-size: 14pt;">Az elm&eacute;leti teszt pontozott, amely ponthat&aacute;rai az al&aacute;bbiakban l&aacute;that&oacute;:</span>
<ul style="list-style-type: disc;">
<li><span style="font-size: 14pt;">0-7: el&eacute;gtelen (1)</span></li>
<li><span style="font-size: 14pt;">8-9: el&eacute;gs&eacute;ges (2)</span></li>
<li><span style="font-size: 14pt;">10-11: k&ouml;zepes (3)</span></li>
<li><span style="font-size: 14pt;">12-13: j&oacute; (4)</span></li>
<li><span style="font-size: 14pt;">14-15: jeles (5)</span></li>
</ul>
</li>
<li><span style="font-size: 14pt;">A gyakorlati &eacute;vfolyam ZH eredm&eacute;nye egyetlen jegy, a helyesen elv&eacute;gzett r&eacute;szfeladatok szerint.</span></li>
<li><span style="font-size: 14pt;">A beadand&oacute; feladatokat meg kell v&eacute;deni a gyakorlatvezetőn&eacute;l. Mindkettő beadand&oacute;val 1 hetet lehet cs&uacute;szni, amely 1-1 jegy levon&aacute;st hoz maga ut&aacute;n.&nbsp;</span></li>
<li><span style="font-size: 14pt;">A f&eacute;l&eacute;v v&eacute;gi jegy a k&eacute;t z&aacute;rthelyi &aacute;tlaga, +- a beadand&oacute;k &eacute;rt&eacute;kel&eacute;s&eacute;ből &aacute;ll &ouml;ssze.</span></li>
</ul>