<p><span style="font-size: 14pt;">A Szoftvertechnol&oacute;gia t&aacute;rgy c&eacute;lja, hogy a hallgat&oacute;k megismerkedjenek a csapatokban t&ouml;rt&eacute;nő szoftverfejleszt&eacute;ssel, a szoftvertervez&eacute;s &eacute;s implement&aacute;ci&oacute; f&aacute;zisainak tanulm&aacute;nyoz&aacute;s&aacute;val &eacute;s megval&oacute;s&iacute;t&aacute;s&aacute;val. A tant&aacute;rgy h&aacute;romfős csoportokban fejleszti a megadott szoftvert, teljes&iacute;tve a f&eacute;l&eacute;v sor&aacute;n elk&ouml;vetkező 4 m&eacute;rf&ouml;ldkő felt&eacute;teleit.&nbsp;</span></p>
<p><span style="font-size: 14pt;">Minden csapat tagjai egy-egy jegyet kapnak a m&eacute;rf&ouml;ldkő teljes&iacute;t&eacute;s&eacute;től &eacute;s saj&aacute;t munk&aacute;juk eredm&eacute;ny&eacute;ből k&ouml;vetkezően, amelynek legal&aacute;bb el&eacute;gs&eacute;gesnek kell lennie. A m&eacute;rf&ouml;ldkőre kapott jegy egy szempontrendszer alapj&aacute;n hat&aacute;rozhat&oacute; meg, amely a m&eacute;rf&ouml;ldkő teljes&iacute;t&eacute;se eset&eacute;n alapvetően 2-5 &eacute;rdemjegyet, nem teljes&iacute;t&eacute;se eset&eacute;n el&eacute;gtelent jelent.&nbsp;</span></p>
<p><span style="font-size: 14pt;">A projekt m&eacute;rf&ouml;ldk&ouml;vei a k&ouml;vetkezők:&nbsp;</span></p>
<ul>
<li><span style="font-size: 14pt;">1. m&eacute;rf&ouml;ldkő: k&ouml;vetelm&eacute;nyelemz&eacute;s &eacute;s tervez&eacute;s (4. h&eacute;t)</span>
<ul>
<li><span style="font-size: 14pt;">megval&oacute;s&iacute;that&oacute;s&aacute;gi terv, funkcion&aacute;lis &eacute;s nem funkcion&aacute;lis specifik&aacute;ci&oacute;, felhaszn&aacute;l&oacute;i eset diagramok, felhaszn&aacute;l&oacute;i t&ouml;rt&eacute;netek, oszt&aacute;ly diagram, komponens diagram, adatb&aacute;zis s&eacute;ma diagram, felhaszn&aacute;l&oacute;i fel&uuml;let tervezete</span></li>
</ul>
</li>
<li><span style="font-size: 14pt;">2. m&eacute;rf&ouml;ldkő: protot&iacute;pus 1. (7. h&eacute;t)</span>
<ul>
<li><span style="font-size: 14pt;">r&eacute;szleges implement&aacute;ci&oacute;, a szoftver haszn&aacute;lati eseteinek 30%-os lefedetts&eacute;ge, issue-k &eacute;s issue board haszn&aacute;lata</span></li>
</ul>
</li>
<li><span style="font-size: 14pt;">3. m&eacute;rf&ouml;ldkő: protot&iacute;pus 2. (10. h&eacute;t)</span>
<ul>
<li><span style="font-size: 14pt;">r&eacute;szleges implement&aacute;ci&oacute;, a szoftver haszn&aacute;lati eseteinek 90%-os lefedetts&eacute;ge, CI/CD, unit tesztek, issue-k &eacute;s issue board haszn&aacute;lata</span></li>
</ul>
</li>
<li><span style="font-size: 14pt;">4. m&eacute;rf&ouml;ldkő: v&eacute;gleges term&eacute;k (13. h&eacute;t)</span>
<ul>
<li><span style="font-size: 14pt;">teljes implement&aacute;ci&oacute;, a szoftver haszn&aacute;lati eseteinek 100%-os lefedetts&eacute;ge, v&eacute;gleges dokument&aacute;ci&oacute;, alapos tesztel&eacute;s</span></li>
</ul>
</li>
</ul>
<p><span style="font-size: 14pt;">A szoftvert a GitLab projektvezető szolg&aacute;ltat&aacute;s seg&iacute;ts&eacute;g&eacute;vel kell megoldani a <a class="inline_disabled" title="Link" href="https://szofttech.inf.elte.hu/" target="_blank" rel="noopener noreferrer">https://szofttech.inf.elte.hu/</a> oldalon. A dokument&aacute;ci&oacute;t a wiki oldalon sz&uuml;ks&eacute;ges elk&eacute;sz&iacute;teni, a feladatokat pedig legal&aacute;bb egy h&eacute;ttel a GitLab issue boardj&aacute;ra fel kell vezetni. A tesztesetek automatiz&aacute;ltak, CI rendszerben futtatand&oacute;k.&nbsp;</span></p>
<p><span style="font-size: 14pt;">A nem m&eacute;rf&ouml;ldk&ouml;ves hetekben a csapatok scrum meeting keretein bel&uuml;l megbesz&eacute;lik a heti előrehalad&aacute;st &eacute;s terveiket a gyakorlatvezetővel.</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;">A tant&aacute;rgy tansz&eacute;ke: Programoz&aacute;selm&eacute;let &eacute;s Szoftvertechnol&oacute;giai Tansz&eacute;k</span></p>
<p><span style="font-size: 14pt;">Tant&aacute;rgy felelőse: Dr. Szendrei Rudolf</span></p>
<p><span style="font-size: 14pt;">Tant&aacute;rgyfelelős honlapja: <a class="inline_disabled" title="Link" href="https://swap.web.elte.hu/" target="_blank" rel="noopener">https://swap.web.elte.hu/</a></span></p>
<p><span style="font-size: 14pt;">Gyakorlatvezető: Rajhona Le&oacute;na, el&eacute;rhetős&eacute;g: &nbsp;<a class="inline_disabled" title="Link" href="mailto:qhn5x3@inf.elte.hu" target="_blank" rel="noopener">qhn5x3@inf.elte.hu</a></span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;">A sz&aacute;monk&eacute;r&eacute;sek a szoftver k&eacute;sz&iacute;t&eacute;se mellett a f&eacute;l&eacute;v k&ouml;zep&eacute;n &eacute;s v&eacute;g&eacute;n v&aacute;rhat&oacute;ak. A f&eacute;l&eacute;vk&ouml;zi teszt sor&aacute;n a t&aacute;rgy addig megismert anyaga, a f&eacute;l&eacute;v v&eacute;gi tesztben pedig mind a Programoz&aacute;si technol&oacute;gia, mind a Szoftvertechnol&oacute;gia t&aacute;rgyak elm&eacute;leti anyagai előker&uuml;lhetnek. &Eacute;rt&eacute;kel&eacute;s&uuml;k sikeres vagy sikertelen, egyszer ism&eacute;telhetőek a f&eacute;l&eacute;v v&eacute;g&eacute;n.</span></p>
<ul>
<li><span style="font-size: 14pt;">0-9 pont: sikertelen</span></li>
<li><span style="font-size: 14pt;">10-15 pont: sikeres&nbsp;</span></li>
</ul>