<p><span style="text-decoration: underline; background-color: #c2e0f4; font-size: 14pt;"><strong><span style="background-color: #c2e0f4;">F&aacute;jlkezel&eacute;s &eacute;s mint&aacute;k 1. feladatsor (Z&ouml;lds&eacute;ges feladat)</span></strong></span></p>
<p><span style="font-size: 14pt;">A feladat egy z&ouml;lds&eacute;ges kiskereskedő k&ouml;nyvt&aacute;rszerkezet&eacute;t val&oacute;s&iacute;tja meg.</span></p>
<p><span style="font-size: 14pt;">1. Hozzuk l&eacute;tre a fők&ouml;nyvt&aacute;rat, aminek z&ouml;lds&eacute;ges_feladat a neve. Z&ouml;lds&eacute;ges Pista &uacute;gy d&ouml;nt&ouml;tt, hogy ezen bel&uuml;l szeretne n&eacute;gy k&uuml;l&ouml;n kont&eacute;nert tartani a fontosabb iratainak: bev&eacute;telek, kiad&aacute;sok, rakt&aacute;rk&eacute;szlet, v&aacute;s&aacute;rl&oacute;k. A bev&eacute;telek k&ouml;z&ouml;tt k&eacute;t dokumentum tal&aacute;lhat&oacute;: 2025_Q3.txt &eacute;s 2025_Q2.txt. A 2025_Q2.txt tartalm&aacute;ban az al&aacute;bbi feljegyz&eacute;s olvashat&oacute;:</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">r&eacute;pa 600Ft 200kg</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">karfiol 750Ft 150kg</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">c&eacute;kla 400Ft 330kg</span></p>
<p><span style="font-size: 14pt;">Ahogy a m&aacute;sik dokumentumhoz ny&uacute;l, az megr&aacute;zza Z&ouml;lds&eacute;ges Pist&aacute;t, mivel nincs hozz&aacute;f&eacute;r&eacute;se ezen adatok megtekint&eacute;s&eacute;hez. M&eacute;rgelődik kettőt, &eacute;s a t&ouml;bbi doboz fel&eacute; fordul.</span></p>
<p><span style="font-size: 14pt;">2. Mivel Cirmi, hű horg&aacute;szt&aacute;rsa megjelent, &eacute;s &uacute;gy d&ouml;nt&ouml;tt, a kiad&aacute;sok gyűjtem&eacute;ny&eacute;t eltulajdon&iacute;tja, ez&eacute;rt ahhoz szint&eacute;n nem ny&uacute;lhat. A teljess&eacute;g kedv&eacute;&eacute;rt: Cirmi mindenki m&aacute;snak megengedi, hogy megsimogassa, csak &ouml;r&ouml;k gazd&aacute;j&aacute;nak &eacute;s a csal&aacute;dj&aacute;nak nem. &Iacute;gy Z&ouml;lds&eacute;ges Pista a rakt&aacute;rk&eacute;szlet mapp&aacute;j&aacute;t n&eacute;zi &aacute;t. Itt tal&aacute;l egy olyan legkev&eacute;sb&eacute;_kedvelt.txt-t, ami tele van k&uuml;l&ouml;nb&ouml;ző adatokkal. Fogja, felc&iacute;mk&eacute;zi, &eacute;s a c&iacute;mk&eacute;re azt &iacute;rja, hogy "ILYEN NEM L&Eacute;TEZIK" (fel&uuml;l&iacute;r&oacute; &aacute;tir&aacute;ny&iacute;t&aacute;s &ndash; a szerk.). A legjobban_kedvelt.txt-ben pedig a k&ouml;vetkezők szerepelnek:</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">retek</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">karfiol</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">cukkini</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">s&uuml;tőt&ouml;k</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">dinnye</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">alma</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">cseresznye</span></p>
<p><span style="font-size: 14pt;">Vakarja a fej&eacute;t, mire r&aacute;j&ouml;n, hogy tavaly a narancs toplist&aacute;s &aacute;runak sz&aacute;m&iacute;tott, ez&eacute;rt fellapozza a dokumentumot, &eacute;s a v&eacute;g&eacute;re oda&iacute;rja. A biztons&aacute;g kedv&eacute;&eacute;rt gyorsan k&eacute;sz&iacute;t egy m&aacute;solatot a kedvencekről biztons&aacute;gi_ment&eacute;s.txt n&eacute;ven, &eacute;s megsz&aacute;molja, h&aacute;ny darab f&aacute;jl van a doboz&aacute;ban.</span></p>
<p><span style="font-size: 14pt;"><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">3. Z&ouml;lds&eacute;ges Pista a fej&eacute;be vette, hogy a k&ouml;zelgő sz&uuml;let&eacute;snapja alkalm&aacute;b&oacute;l egy h&oacute;napon kereszt&uuml;l k&uuml;l&ouml;nleges, t&ouml;bbf&eacute;le alm&aacute;t fog &aacute;rus&iacute;tani. M&eacute;g m&uacute;ltkor a besz&aacute;ll&iacute;t&oacute;ja mondta is, hogy van erre lehetős&eacute;g. E</span><span class="NormalTextRun SCXW249563413 BCX0">nnek &eacute;rdek&eacute;ben az </span></span><span class="TextRun MacChromeBold SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">almafajt&aacute;k.txt</span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">-t &aacute;th&uacute;zza a rakt&aacute;rk&eacute;szlet k&ouml;nyvt&aacute;r&aacute;ba (</span><span class="NormalTextRun SpellingErrorV2Themed SCXW249563413 BCX0">WinSCP</span><span class="NormalTextRun SCXW249563413 BCX0"> seg&iacute;ts&eacute;g&eacute;vel). </span><span class="NormalTextRun SCXW249563413 BCX0">Eml&eacute;kszik, olyan gyorsan &eacute;s olyan sokat kellett k&ouml;rm&ouml;lnie, hogy ut&aacute;na napokig pihentetnie kellett a kez&eacute;t. K&iacute;v&aacute;ncsis&aacute;gb&oacute;l </span></span><span class="TextRun Underlined SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">megsz&aacute;molja </span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">a karakterek, szavak &eacute;s sorok darabsz&aacute;m&aacute;t.</span><span class="NormalTextRun SCXW249563413 BCX0"> Ezut&aacute;n a </span></span><span class="TextRun MacChromeBold SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">rendezett_almafajt&aacute;k.txt</span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">-be sorba rendezi a fajt&aacute;kat</span><span class="NormalTextRun SCXW249563413 BCX0">.</span> </span><span class="TextRun Underlined SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">C</span><span class="NormalTextRun SCXW249563413 BCX0">soportos&iacute;tva &eacute;s sz&aacute;mszerűs&iacute;tve</span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0"> az egyes kezdőbetűvel rendelkező fajt&aacute;kat</span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">, cs&ouml;kkenő sorrendbe rendez, &eacute;s </span></span><span class="TextRun Underlined SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">kiv&aacute;lasztja </span></span><span class="TextRun SCXW249563413 BCX0" lang="HU-HU" data-contrast="auto"><span class="NormalTextRun SCXW249563413 BCX0">az első &ouml;t leggyakoribb </span><span class="NormalTextRun SCXW249563413 BCX0">kezdőbetűjű alm&aacute;t</span><span class="NormalTextRun SCXW249563413 BCX0">.</span><span class="NormalTextRun SCXW249563413 BCX0"> Ezt nem &iacute;rja fel, de &eacute;rdekess&eacute;gk&eacute;ppen megteszi.&nbsp;</span></span></span></p>
<p><span style="font-size: 14pt;">4. Az utols&oacute; feladata, hogy a v&aacute;s&aacute;rl&oacute;k k&ouml;nyvt&aacute;rat is &aacute;tn&eacute;zze. Itt tal&aacute;lja a leggyakoribb_v&aacute;s&aacute;rl&oacute;k.txt (WinSCP), amelyben elősz&ouml;r megn&eacute;zi, h&aacute;ny sor van. Ezut&aacute;n megn&eacute;zi, mely sorokban tal&aacute;lhat&oacute; Istv&aacute;n, illetve Istv&aacute;n vagy &Eacute;va. Arra is k&iacute;v&aacute;ncsi, hogy h&aacute;ny olyan v&aacute;s&aacute;rl&aacute;s volt, ahol 1000 &eacute;s 2000 Ft k&ouml;z&ouml;tti &ouml;sszeg&eacute;rt v&aacute;s&aacute;roltak.&nbsp;</span></p>
<p><span style="font-size: 14pt;">5. Z&ouml;lds&eacute;ges Pista t&uacute;l makacs. M&aacute;r r&eacute;g be kellett volna fejeznie a feladatot, de m&eacute;g egyetlen egy dologra k&iacute;v&aacute;ncsi. &Eacute;va, szeretett szerelme mennyit hagyott n&aacute;la a v&aacute;s&aacute;rl&aacute;sok alkalm&aacute;val. A kapott eredm&eacute;nyt felc&iacute;mk&eacute;zi egy &Eacute;va_kiad&aacute;sai.txt dokumentumba.&nbsp; (Seg&iacute;ts&eacute;g: a megfelelő mezők kiv&aacute;g&aacute;sa ut&aacute;n a paste -sd+ - | bc cs&ouml;vez&eacute;st kell v&eacute;grehajtani a command line v&eacute;g&eacute;n &ndash; a szerk.)&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 14pt;"><strong><span style="text-decoration: underline;"><span style="background-color: #c2e0f4;">F&aacute;jlkezel&eacute;s &eacute;s mint&aacute;k 2. feladatsor (Macsk&aacute;s feladat)</span></span></strong></span></p>
<p><span style="font-size: 14pt;">A macsk&aacute;k vil&aacute;guralomra t&ouml;rnek. Azonban, mielőtt nekil&aacute;tn&aacute;nak a legnehezebb feladatnak, Fal&aacute;nk &eacute;s Bajusz, a k&eacute;t irodista n&eacute;h&aacute;ny iratot m&eacute;g &aacute;tn&eacute;z a nagyszab&aacute;s&uacute; terv előtt.</span></p>
<p><span style="font-size: 14pt;">1. A fő iratt&aacute;ruk neve macska_birodalom_honfoglal&aacute;s_2025. Ebben a k&ouml;vetkező mapp&aacute;k tal&aacute;lhat&oacute;ak: haditerv, parancsnokok, &aacute;ltal&aacute;nos.&nbsp;</span></p>
<p><span style="font-size: 14pt;">Fal&aacute;nk a haditervet n&eacute;zi &aacute;t. Tal&aacute;l egy kiss&eacute; gyűr&ouml;tt, gy&uuml;m&ouml;lcsl&eacute;vel szennyezett dokumentumot, amelynek a neve elők&eacute;sz&uuml;letek.txt &eacute;s a tartalma:</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">100 liter joghurt</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">50 kg kecskesajt</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">20 kg &ouml;mlesztett sajt</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">100 db eg&eacute;rcsapda</span></p>
<p style="padding-left: 40px;"><span style="font-size: 14pt;">minden katon&aacute;nak patk&aacute;nyjelmez</span></p>
<p><span style="font-size: 14pt;">Mivel nem tal&aacute;lt olyan iratot, amely a nagy csat&aacute;ra vonatkozik, &uacute;gy d&ouml;nt&ouml;tt, l&eacute;trehoz egy &uuml;reset csata_jegyzet.txt-k&eacute;nt, majd a szint&eacute;n &uacute;j csata_megval&oacute;s&iacute;tani.txt-re felc&iacute;mk&eacute;zi a "A kampusz elfoglal&aacute;sa elsődleges c&eacute;lk&eacute;nt szerepel" sz&ouml;veggel (hozz&aacute;fűző &aacute;tir&aacute;ny&iacute;t&aacute;s &ndash; a szerk).</span></p>
<p><span style="font-size: 14pt;">2. Bajusz a parancsnokok mapp&aacute;j&aacute;t b&ouml;ng&eacute;szi. Szok&aacute;s&aacute;hoz h&iacute;ven nem &eacute;rdekli a szab&aacute;lyok sokas&aacute;ga, megpr&oacute;b&aacute;lja megnyitni a Fal&aacute;nk_adatai.txt &aacute;llom&aacute;nyt. Azonban ehhez nincs jogosults&aacute;ga. Sőt, ahogy &eacute;szreveszi, senkinek nincs. Ehelyett fellapozza a saj&aacute;tj&aacute;t, a Bajusz_adatai.txt-t (WinSCP-vel &aacute;thelyezni a megfelelő k&ouml;nyvt&aacute;rba).&nbsp; Szeretn&eacute; tudni, melyik sorokban szerepelnek sz&aacute;mok, ez&eacute;rt kilist&aacute;zza ezeket. A lakc&iacute;m&eacute;t szeretn&eacute; teljesen nagybetűsk&eacute;nt megjelen&iacute;teni, de a f&aacute;jlban nem &iacute;rja &aacute;t (fontos: csak a telep&uuml;l&eacute;snevet szeretn&eacute;nk nagybetűsen l&aacute;tni &ndash; a szerk). K&iacute;v&aacute;ncsi arra is, h&aacute;ny darab karakter, sz&oacute; &eacute;s sor van a f&aacute;jlban.</span></p>
<p><span style="font-size: 14pt;">3. Megsz&oacute;lalt a bunker hangosbemond&oacute;ja. A Ctrl + C gombot megnyomva a k&eacute;t macska &eacute;rtes&uuml;lt a nagy h&iacute;rről, miszerint "Sikeresen bevett&uuml;k&nbsp; Ausztr&aacute;li&aacute;t! A kenguruk m&aacute;r a parancsnoks&aacute;gunk alatt &aacute;llnak!" (Hogy ne legyen zavar&oacute;, el&eacute;g egyszer csapd&aacute;zni, ut&aacute;na t&ouml;r&ouml;lhetj&uuml;k a SIGINT-ről &ndash; a szerk.)</span></p>
<p><span style="font-size: 14pt;">4. Elh&aacute;rult a vesz&eacute;ly, Bajusz tudja folytatni a dokumentumok k&ouml;z&ouml;tti bogar&aacute;sz&aacute;st. Le szeretn&eacute; k&eacute;rdezni, hogy az adatai sorrendben hogy n&eacute;zn&eacute;nek ki, ez&eacute;rt megn&eacute;zi. A sz&uuml;let&eacute;s&eacute;vel kapcsolatos inform&aacute;ci&oacute;kat a Bajusz_sz&uuml;let&eacute;si_adatok.txt-be elmenti. Gondolkodik, de r&aacute;j&ouml;n, hogy nem a legjobb nevet adta ennek a dokumentumnak, &iacute;gy &aacute;tnevezi Bajuszka_sz&uuml;like.txt-re. Igen, m&aacute;ris jobb. Mivel ezzel a k&ouml;nyvt&aacute;rral v&eacute;gzett, &aacute;tl&eacute;p az &aacute;ltal&aacute;nos dokumentumokhoz. Itt visszaolvassa az utols&oacute;_hadművelet.txt tartalm&aacute;t (WinSCP), hogy a parancsnokok &eacute;s a katon&aacute;k k&ouml;z&ouml;tt milyen lejelentkez&eacute;sek t&ouml;rt&eacute;ntek a legut&oacute;bbi csat&aacute;roz&aacute;s ut&aacute;n. H&aacute;ny sorban szerepel Bajusz vagy Fal&aacute;nk t&aacute;bornok neve? Az is &eacute;rdekli, hogy h&aacute;nyf&eacute;le ny&aacute;vog&aacute;s tal&aacute;lhat&oacute; ebben a logban. Azt is szeretn&eacute; tudni, ezen ny&aacute;vog&aacute;sok k&ouml;z&uuml;l az első 3 milyen gyakoris&aacute;g&uacute;. &Eacute;rdekli, hogy kenguru vagy eg&eacute;r szerepel-e t&ouml;bbsz&ouml;r a dokumentumban.</span></p>
<p><span style="font-size: 14pt;">5. Fal&aacute;nk parancsnok pont ekkor v&eacute;gez. Megfordul, &eacute;s teljes felfordul&aacute;st tal&aacute;l maga k&ouml;r&uuml;l. Bajusz &ouml;sszevissza eldob&aacute;lta a dokumentumokat. Elősz&ouml;r csak a jogosults&aacute;gait veszi el a k&ouml;nyvt&aacute;rakt&oacute;l (csak a felhaszn&aacute;l&oacute;nak van joga, senki m&aacute;snak nincs semmihez a mappaszerkezetben). Majd pedig, Bajusz s&eacute;rtőd&ouml;tt arc&aacute;t l&aacute;tva, m&eacute;rg&eacute;ben &uacute;gy d&ouml;nt, hogy a b&aacute;zis hangrendszer&eacute;be bele&uuml;lteti, hogy "Bajusz az irod&aacute;b&oacute;l ki van tiltva!".&nbsp;</span></p>